## Pandas

- Pandas veri biliminin excel'i olarak bilinir.

### Series/Seriler

- Numpy array'i gibi düşünülebilir ancak daha esnek bir yapıdır.
- Serileri birçok farklı veri yapısından oluşturabiliriz.

In [8]:
import numpy as np
import pandas as pd

In [3]:
mydict = {"Atıl" : 50 , "Zeynep" : 40 , "Mehmet" : 30}
# Bu işlem sanki asıl veriler yaşlar isimler ise label'mış gibi sonuç veriyor. 
pd.Series(mydict)

Atıl      50
Zeynep    40
Mehmet    30
dtype: int64

In [5]:
myages = [50,40,30]
mynames = ["Atıl" , "Zeynep" , "Mehmet"]

pd.Series(myages)

0    50
1    40
2    30
dtype: int64

In [6]:
pd.Series(myages,mynames)

Atıl      50
Zeynep    40
Mehmet    30
dtype: int64

In [7]:
pd.Series(data=myages , index=mynames)

Atıl      50
Zeynep    40
Mehmet    30
dtype: int64

In [9]:
nmpyarr = np.array([50,40,30])

pd.Series(nmpyarr)

0    50
1    40
2    30
dtype: int32

In [10]:
pd.Series(nmpyarr , index=mynames)

Atıl      50
Zeynep    40
Mehmet    30
dtype: int32

In [11]:
# Burda asıl veriler string old. için dtype'ı object döndürdü
pd.Series(["John","Tom","David"] , [1,2,3])

1     John
2      Tom
3    David
dtype: object

In [13]:
yarışmasonucu = pd.Series([20,10,8] , ["John","Tom","David"])
yarışmasonucu

John     20
Tom      10
David     8
dtype: int64

In [14]:
yarışmasonucu["Tom"] # yarışma sonucunda Tom'un kaç puan aldığını bu şekilde çekeriz

10

### Dataframe
- Serilerin birleştirilmiş hali gibi düşünebiliriz, iki boyutlu yapılardır.
- Excel tablosuna benzer bir çıktı verir.

In [15]:
data = np.random.randn(4,3)
data

array([[-0.86741253, -1.75239685,  0.84698909],
       [-0.91354969, -1.25035015,  0.18674016],
       [ 0.39250627,  1.35348022,  1.26911058],
       [ 0.68861602,  1.58898362, -1.85865667]])

In [16]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0 -0.867413 -1.752397  0.846989
1 -0.913550 -1.250350  0.186740
2  0.392506  1.353480  1.269111
3  0.688616  1.588984 -1.858657

In [17]:
dataFrame[0]

0   -0.867413
1   -0.913550
2    0.392506
3    0.688616
Name: 0, dtype: float64

In [18]:
type(dataFrame[0]) # demek ki dataframeler serilerin birleşiminden oluşur.

pandas.core.series.Series

In [19]:
newdataframe = pd.DataFrame(data,index=["John","Tom","David","Marry"],columns=["Maas","Yas","CalısmaSaati"])
newdataframe

           Maas       Yas  CalısmaSaati
John  -0.867413 -1.752397      0.846989
Tom   -0.913550 -1.250350      0.186740
David  0.392506  1.353480      1.269111
Marry  0.688616  1.588984     -1.858657

In [20]:
newdataframe["Yas"]

John    -1.752397
Tom     -1.250350
David    1.353480
Marry    1.588984
Name: Yas, dtype: float64

In [21]:
newdataframe[["Yas","CalısmaSaati"]]

            Yas  CalısmaSaati
John  -1.752397      0.846989
Tom   -1.250350      0.186740
David  1.353480      1.269111
Marry  1.588984     -1.858657

In [22]:
newdataframe.loc["David"] #column değil de raw seçmek istersek loc(yani locate) fonk.kullanılır

Maas            0.392506
Yas             1.353480
CalısmaSaati    1.269111
Name: David, dtype: float64

In [23]:
# index bazlı location işlemi yapar
newdataframe.iloc[2] #2. indekse sahip olanı döndürür yani David

Maas            0.392506
Yas             1.353480
CalısmaSaati    1.269111
Name: David, dtype: float64